In [1]:
import pandas as pd
# Make a dataframe from a dictionary
mydict = {
    'name':['radhika','abhijit','shrikala',],
    'age':[1,32,26],
    'height':[1.5,5.5,5.2]
}

In [15]:
df=pd.DataFrame(mydict)
df

   age  height      name
0    1     1.5   radhika
1   32     5.5   abhijit
2   26     5.2  shrikala

In [8]:
df.head()
df.head(1)
df.tail()
df.tail(1)

   age  height      name
2   26     5.2  shrikala

In [9]:
df

   age  height      name
0    1     1.5   radhika
1   32     5.5   abhijit
2   26     5.2  shrikala

In [16]:
df.set_index('age')
print(df)
df.set_index('age',inplace='True') 
print(df)

   age  height      name
0    1     1.5   radhika
1   32     5.5   abhijit
2   26     5.2  shrikala
     height      name
age
1       1.5   radhika
32      5.5   abhijit
26      5.2  shrikala

In [13]:
df

     height      name
age
1       1.5   radhika
32      5.5   abhijit
26      5.2  shrikala

In [19]:
#Reference a column or list of columns
print(df.height)
print(df['height'])
print(df[['height','name']])

age
1     1.5
32    5.5
26    5.2
Name: height, dtype: float64
age
1     1.5
32    5.5
26    5.2
Name: height, dtype: float64
     height      name
age
1       1.5   radhika
32      5.5   abhijit
26      5.2  shrikala

# Convert to List

In [27]:
names=df.name.tolist()
names=df['name'].tolist()
print(names)

['radhika', 'abhijit', 'shrikala']

In [29]:
#Convert more than one column to a list
import numpy as np
myarray2=np.array(df[['name','height']])
myarray2

array([['radhika', 1.5],
       ['abhijit', 5.5],
       ['shrikala', 5.2]], dtype=object)

In [31]:
#Conversely convert a numpy array to a dataframe
df2=pd.DataFrame(myarray2)
df2

          0    1
0   radhika  1.5
1   abhijit  5.5
2  shrikala  5.2

# IO - CSV

In [32]:
df=pd.read_csv('datasets/ZILL-Z60580_SPY.csv')

In [33]:
df

         Date   Value
0  2016-06-30  3.3191
1  2016-05-31  3.4938
2  2015-12-31  3.9208
3  2015-10-31  3.7461

In [35]:
df.set_index('Date',inplace=True)

In [36]:
df

             Value
Date
2016-06-30  3.3191
2016-05-31  3.4938
2015-12-31  3.9208
2015-10-31  3.7461

In [37]:
df.to_csv('newcsv.csv',header=False)
df.to_csv('newcsv2.csv')

In [38]:
df=pd.read_csv('newcsv.csv',names=['Date','lyndhurst_HPI'],index_col=0)

In [39]:
df

            lyndhurst_HPI
Date
2016-06-30         3.3191
2016-05-31         3.4938
2015-12-31         3.9208
2015-10-31         3.7461

In [40]:
df2=pd.read_csv('newcsv.csv',names=['Date','lyndhurst_HPI'])

In [41]:
df2

         Date  lyndhurst_HPI
0  2016-06-30         3.3191
1  2016-05-31         3.4938
2  2015-12-31         3.9208
3  2015-10-31         3.7461

In [42]:
#Rename columns

In [44]:
df3=df2.rename(columns={'lyndhurst_HPI':'HPI_07071'})
print df3

         Date  HPI_07071
0  2016-06-30     3.3191
1  2016-05-31     3.4938
2  2015-12-31     3.9208
3  2015-10-31     3.7461

In [46]:
df3.dtypes

Date          object
HPI_07071    float64
dtype: object